package lesson1.dz11;

public class Main {
    public static void main(String[] args) {
//        Item item1 = new Item();
//        Item item2 = new Item(15100,"Frige", 158);
//
//        System.out.println(item1.getDescription());
//        System.out.println(item2.getDescription());
    }
}
//Создайте пользовательский класс для описания товара (предположим, это задел для
//интернет-магазина). В качестве свойств товара можете использовать значение цены,
//описание, вес товара. Создайте пару экземпляров вашего класса и протестируйте их
//работу